{
  "author.firstName": "Атай",
  "author.lastName": "Самаков",
  "author.fullName": "Атай Самаков",
  "author.specialization": "Frontend Разработчик",

  "menu.about": "О себе",
  "menu.work": "Работа",
  "menu.education": "Образование",
  "menu.skills": "Навыки",

  "label.resume": "Резюме",
  "label.present": "СЕЙЧАС",
  "label.project": "Проект",
  "label.menu": "Меню",

  "about.description": "<0>Привет! Я Атай, увлеченный фронтенд-разработчик с вниманием к деталям и прочной основой в JavaScript, React и современных веб-технологиях.</0><0>Я глубоко разбираюсь в HTML, CSS, JavaScript (ES6+), TypeScript, а также в таких фреймворках, как React и Redux. Моя специализация — создание интуитивно понятных и отзывчивых веб-приложений.</0><0>Моя цель — продолжать развиваться как разработчик, стремясь в будущем занять должность старшего frontend-разработчика, чтобы руководить проектами и наставлять других.</0><0>Я получил степень бакалавра в области информационных систем и технологий в КНИТУ-КАИ и завершил продвинутые курсы программирования в «Школе 21» от Сбербанка.</0><0>Я твердо привержен к написанию чистого, поддерживаемого кода и верю в важность непрерывного обучения. Такие книги, как «Чистый код» Роберта Мартина и «Effective TypeScript» Дэна Вандеркама, сильно повлияли на мою философию разработки.</0><0>Буду рад, если свяжетесь со мной для совместной работы над проектом, обсуждения карьерных возможностей или просто для разговора о последних тенденциях в Frontend-разработке!</0>",

  "education.knitu.name": "КНИТУ-КАИ",
  "education.knitu.field": "Информационные системы и технологии",
  "education.knitu.description": "Успешно получил степень бакалавра, что заложило прочную основу для дальнейшего совершенствования в программировании. Изучал основы управления базами данных, объектно-ориентированное программирование на C#, языки программирования C/C++, а также алгоритмы и структуры данных (стеки, очереди, списки, массивы и т.д.).",

  "education.school21.name": "Школа 21",
  "education.school21.field": "Курсы программирования",
  "education.school21.description": "Изучал языки программирования C/C++ и разрабатывал небольшие проекты, которые позволили мне углубить знания в области основ программирования, таких как потоки, семафоры, мьютексы, сокеты и другие. Обучение в школе было ориентировано на практическую работу, что позволило мне приобрести значительный опыт в написании кода.",

  "work.myack.name": "Myack",
  "work.myack.location": "Нью Йорк США",
  "work.myack.ziphy.name": "Ziphy",
  "work.myack.ziphy.description": "<0>1. Разработал с нуля безопасную многостраничную онлайн-форму с надежной проверкой данных и возможностями генерации PDF;</0><0>2. Реализовал удобную систему записи пациентов к врачам.</0>",
  "work.myack.labq.name": "LabQ",
  "work.myack.labq.description": "<0>1. Спроектировал и разработал интерактивные графики для визуализации медицинских данных пациентов;</0><0>2. Создал инновационную, фильтруемую карту человеческого тела для отображения заболеваний пациентов и соответствующих медицинских показателей, предоставив мощный инструмент для диагностики и лечения.</0>",

  "work.welbex.name": "Welbex",
  "work.welbex.location": "Москва Россия",
  "work.welbex.amocrm.name": "AmoCRM",
  "work.welbex.amocrm.description": "<0>1. Разрабатывал и поддерживал кастомные интеграции для платформы AmoCRM, используя JavaScript, React, Redux Toolkit, Axios, HTML и CSS.</0><0>2. Успешно переписал устаревшие JavaScript приложения на React, улучшив их поддерживаемость и производительность;</0><0>3. Взаимодействовал с дизайнерами, бэкенд-разработчиками, тестировщиками и менеджерами проектов на всех этапах жизненного цикла разработки программного обеспечения, от идеи до развертывания.</0>",

  "work.proxyone.name": "Proxyone",
  "work.proxyone.location": "Познань Польша",
  "work.proxyone.description": "<0>1. Разработал адаптивные и SEO-оптимизированные сайты, лендинги и административные панели, используя HTML, CSS и JavaScript</0><0>2. Оптимизировал производительность сайтов для улучшения скорости загрузки страниц.</0>"
}